alibaba/AliOS-Things/platform/mcu/stm32l4xx/src/STM32L433RC-Nucleo/Kids_A10/nau8810.c
#include <stdio.h>
#include "nau8810.h"
#include "stm32l4xx_hal.h"

#define NAU8810_I2C_SLAVE_ADDR                            0x1a
#define NAU8810_ADDR_TRANS(n)                             ((n) << 1)
#define NAU8810_I2C_ADDR                                  NAU8810_ADDR_TRANS(NAU8810_I2C_SLAVE_ADDR)

#define NAU8810_REG_RESET                                 0x00
#define NAU8810_REG_POWER1                                0x01
#define NAU8810_REG_POWER2                                0x02
#define NAU8810_REG_POWER3                                0x03
#define NAU8810_REG_IFACE                                 0x04
#define NAU8810_REG_COMP                                  0x05
#define NAU8810_REG_CLOCK                                 0x06
#define NAU8810_REG_SMPLR                                 0x07
#define NAU8810_REG_DAC                                   0x0A
#define NAU8810_REG_DACGAIN                               0x0B
#define NAU8810_REG_ADC                                   0x0E
#define NAU8810_REG_ADCGAIN                               0x0F
#define NAU8810_REG_EQ1                                   0x12
#define NAU8810_REG_EQ2                                   0x13
#define NAU8810_REG_EQ3                                   0x14
#define NAU8810_REG_EQ4                                   0x15
#define NAU8810_REG_EQ5                                   0x16
#define NAU8810_REG_DACLIM1                               0x18
#define NAU8810_REG_DACLIM2                               0x19
#define NAU8810_REG_NOTCH1                                0x1B
#define NAU8810_REG_NOTCH2                                0x1C
#define NAU8810_REG_NOTCH3                                0x1D
#define NAU8810_REG_NOTCH4                                0x1E
#define NAU8810_REG_ALC1                                  0x20
#define NAU8810_REG_ALC2                                  0x21
#define NAU8810_REG_ALC3                                  0x22
#define NAU8810_REG_NOISEGATE                             0x23
#define NAU8810_REG_PLLN                                  0x24
#define NAU8810_REG_PLLK1                                 0x25
#define NAU8810_REG_PLLK2                                 0x26
#define NAU8810_REG_PLLK3                                 0x27
#define NAU8810_REG_ATTEN                                 0x28
#define NAU8810_REG_INPUT_SIGNAL                          0x2C
#define NAU8810_REG_PGAGAIN                               0x2D
#define NAU8810_REG_ADCBOOST                              0x2F
#define NAU8810_REG_OUTPUT                                0x31
#define NAU8810_REG_SPKMIX                                0x32
#define NAU8810_REG_SPKGAIN                               0x36
#define NAU8810_REG_MONOMIX                               0x38
#define NAU8810_REG_POWER4                                0x3A
#define NAU8810_REG_TSLOTCTL1                             0x3B
#define NAU8810_REG_TSLOTCTL2                             0x3C
#define NAU8810_REG_DEVICE_REVID                          0x3E
#define NAU8810_REG_I2C_DEVICEID                          0x3F
#define NAU8810_REG_ADDITIONID                            0x40
#define NAU8810_REG_RESERVE                               0x41
#define NAU8810_REG_OUTCTL                                0x45
#define NAU8810_REG_ALC1ENHAN1                            0x46
#define NAU8810_REG_ALC1ENHAN2                            0x47
#define NAU8810_REG_MISCCTL                               0x49
#define NAU8810_REG_OUTTIEOFF                             0x4B
#define NAU8810_REG_AGCP2POUT                             0x4C
#define NAU8810_REG_AGCPOUT                               0x4D
#define NAU8810_REG_AMTCTL                                0x4E
#define NAU8810_REG_OUTTIEOFFMAN                          0x4F
#define NAU8810_REG_MAX                                   NAU8810_REG_OUTTIEOFFMAN

#define NAU8810_I2C_DEVICEID_VAL                          0x01a
#define NAU8810_ADDITIONID_VAL                            0x0ca


static int nau8810_reg_read(uint8_t reg, uint16_t *pdata)
{
	uint8_t reg_raw = 0;
	uint8_t buf[2] = {0};
	int ret = 0;
	
	if (pdata == NULL) {
		KIDS_A10_PRT("parameters is invalid\n");
		return -1;
	}
	reg_raw = reg << 1 & 0xfe;
	ret = hal_i2c_mem_read(&brd_i2c2_dev, NAU8810_I2C_ADDR, (uint16_t)reg_raw, 1, buf, 2, 1000);
	if (ret != 0) {
		KIDS_A10_PRT("hal_i2c_mem_read return %d\n", reg);
		return ret;
	}
	*pdata = (uint16_t)((buf[0] << 8 & 0xff00) | (buf[1] & 0xff));
	
	return 0;
}

static int nau8810_reg_write(uint8_t reg, uint16_t data)
{
	uint8_t reg_raw = 0;
	uint8_t data_raw = 0;
	
	reg_raw = reg << 1;
	reg_raw |= (uint8_t)(data >> 1 & 0x01);
	data_raw = (uint8_t)(data & 0xff);
	
	return hal_i2c_mem_write(&brd_i2c2_dev, NAU8810_I2C_ADDR, (uint16_t)reg_raw, 1, &data_raw, 1, 1000);
}

static int drv_codec_nau8810_validate_id(void)
{
	int ret               = 0;
	uint16_t device_revid = 0;
	uint16_t i2c_deviceid = 0;
	uint16_t additionid   = 0;
	
	ret = nau8810_reg_read(NAU8810_REG_I2C_DEVICEID, &i2c_deviceid);
	if (ret != 0) {
		KIDS_A10_PRT("nau8810_reg_read return %d\n", ret);
		return ret;
	}
	if (i2c_deviceid != NAU8810_I2C_DEVICEID_VAL) {
		KIDS_A10_PRT("read NAU8810_REG_I2C_DEVICEID: %hu\n", i2c_deviceid);
		return -1;
	}
	
	ret = nau8810_reg_read(NAU8810_REG_ADDITIONID, &additionid);
	if (ret != 0) {
		KIDS_A10_PRT("nau8810_reg_read return %d\n", ret);
		return ret;
	}
	if (additionid != NAU8810_ADDITIONID_VAL) {
		KIDS_A10_PRT("read NAU8810_REG_ADDITIONID: %hu\n", additionid);
		return -1;
	}
	
	return 0;
}

static int drv_codec_nau8810_set_default_config(void)
{
	int ret = 0;

	ret |= nau8810_reg_write(NAU8810_REG_RESET, 0x000);                  /* Reset all registers */ 
	krhino_task_sleep(krhino_ms_to_ticks(50));

	ret |= nau8810_reg_write(NAU8810_REG_POWER1, 0x03F);
	ret |= nau8810_reg_write(NAU8810_REG_POWER2, 0x1B5);                 /* Enable L/R Headphone, ADC Mix/Boost, ADC */

	ret |= nau8810_reg_write(NAU8810_REG_POWER3, 0x07F);                 /* Enable L/R main mixer, DAC */			
	ret |= nau8810_reg_write(NAU8810_REG_IFACE, 0x090);                  /* 16-bit word length, I2S format, Stereo */			
	ret |= nau8810_reg_write(NAU8810_REG_COMP, 0x000);                   /* Companding control and loop back mode (all disable) */

	ret |= nau8810_reg_write(NAU8810_REG_CLOCK, 0x1AD);                  /* Divide by 6, 16K */
	ret |= nau8810_reg_write(NAU8810_REG_SMPLR, 0x006);                  /* 16K for internal filter cofficients */

	ret |= nau8810_reg_write(NAU8810_REG_DAC, 0x008);                    /* DAC softmute is disabled, DAC oversampling rate is 128x */
	ret |= nau8810_reg_write(NAU8810_REG_ADC, 0x108);                    /* ADC HP filter is disabled, ADC oversampling rate is 128x */
	ret |= nau8810_reg_write(NAU8810_REG_ADCGAIN, 0x1EF);                /* ADC left digital volume control */
	ret |= nau8810_reg_write(16, 0x1EF);                                 /* ADC right digital volume control */

	ret |= nau8810_reg_write(43, 0x010);

	//ret |= nau8810_reg_write(NAU8810_REG_INPUT_SIGNAL, 0x000);         /* LLIN/RLIN is not connected to PGA */
	ret |= nau8810_reg_write(NAU8810_REG_INPUT_SIGNAL, 0x033);           /* LMICN/LMICP is connected to PGA */
	ret |= nau8810_reg_write(NAU8810_REG_ADCBOOST, 0x050);               /* LLIN connected, and its Gain value */
	ret |= nau8810_reg_write(48, 0x050);                                 /* RLIN connected, and its Gain value */

	//ret |= nau8810_reg_write(NAU8810_REG_ADCBOOST, 0x107);             /* LAUXIN connected, and its Gain value */
	//ret |= nau8810_reg_write(48, 0x107);                               /* RAUXIN Gain, and AUXIN Gain value */

	ret |= nau8810_reg_write(NAU8810_REG_OUTPUT, 0x047);

	ret |= nau8810_reg_write(NAU8810_REG_SPKMIX, 0x001);                 /* Left DAC connected to LMIX */
	ret |= nau8810_reg_write(51, 0x000);                                 /* Right DAC connected to RMIX */

	ret |= nau8810_reg_write(NAU8810_REG_SPKGAIN, 0x139);                /* LSPKOUT Volume */
	ret |= nau8810_reg_write(55, 0x139);                                 /* RSPKOUT Volume */

	if (ret != 0) {
		KIDS_A10_PRT("nau8810_reg_write return %d\n", ret);
	}
	
	return ret;
}

static int drv_codec_nau8810_set_volume(uint8_t volume)
{
	int ret = 0;
	
	ret = nau8810_reg_write(NAU8810_REG_DACGAIN, volume);
	if (ret != 0)
		KIDS_A10_PRT("nau8810_reg_write return %d\n", ret);
	
	return ret;
}

int drv_codec_nau8810_init(void)
{
	int ret = 0;
	
	ret = drv_codec_nau8810_validate_id();
	if (ret != 0)
		return -1;
	
	ret = drv_codec_nau8810_set_default_config();
	if (ret != 0)
		return -1;
	
	ret = drv_codec_nau8810_set_volume(0x80);
	if (ret != 0)
		return -1;
	
	return 0;
}
